prot_app/app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 9]]
---
    </div>
      <% @users.posts.each do |post|%>