prot_app/app/controllers/posts_controller.rb

  def show
    @posts = Post.find_by(id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]

  def create
    @posts = Post.new(
      content: params[:content],
      user_id: @current_user.id,
      subject: params[:subject]
    )
    if @posts.content == "出席１"
      @posts.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id", "subject") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "出席"], ["created_at", "2020-02-23 08:18:55.882746"], ["updated_at", "2020-02-23 08:18:55.882746"], ["user_id", 2], ["subject", "プラズマ"]]

  def edit
    @posts = Post.find_by(id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]

  def update
    @posts = Post.find_by(id: params[:id])
    @posts.content = params[:content]
    @posts.subject = params[:subject]
    @posts.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "subject" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["subject", "プラズマ"], ["updated_at", "2020-02-23 08:31:51.532358"], ["id", 27]]

  def destroy
    @posts = Post.find_by(id: params[:id])
    @posts.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 37]]