prot_app/app/controllers/users_controller.rb

  def login
    @users = User.find_by(email: params[:email], password: params[:password])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."password" = $2 LIMIT $3  [["email", "oil@gmail.com"], ["password", "abura"], ["LIMIT", 1]]

  def index
    @users = User.all.order(created_at: :desc)
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC

  def show
    @users = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def create
    @users = User.new(name: params[:name],email: params[:email],GID: params[:GID], password: params[:password])
    if @users.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password", "GID") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "つんつん"], ["email", "aaaaaaa"], ["created_at", "2020-06-05 17:40:39.526864"], ["updated_at", "2020-06-05 17:40:39.526864"], ["password", "aaaaaaaa"], ["GID", "54129"]]

  def edit
    @users = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def update
    @users = User.find_by(id: params[:id])
    @users.name = params[:name]
    @users.GID = params[:GID]
    @users.email = params[:email]
    if @users.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "brandow1@ezet.com"], ["updated_at", "2020-02-15 13:47:11.698670"], ["id", 5]]